'浸漬タンクA
'===================================================================================================================
'
'<<<<<<<	ユニット	>>>>>>>>
'
'===================================================================================================================
'
'	浸漬タンクA管理 注水管理
'	
'半径(円錐の高さ）×半径(円錐の高さ）×円周率×円錐の高さ×1/3
'550 x 550 x 3.14 x 550 x 1/3
'半径×半径×円周率×円錐の高さ
'550 x 550 x 3.14 x 800
'
'0(210mm)mmまでの?計算値	(円錐の高さ210mm）×(円錐の高さ210mm）×円周率×(円錐の高さ210mm)×1/3  /1000000
'1206(550-210mm)までの?計算	(円錐の高さsclx0.2818）×(円錐の高さsclx0.2818）×円周率×(円錐の高さsclx0.2818)×1/3  /1000000
'1206(550-210mm)からの?計算	半径(550)×半径(550)×円周率×(円柱の高さsclx0.2818)/1000000
'
'円錐部の  x? →  yscl を導きます。
'?+9.69318?=(円柱の高さsclx0.2818)×(円柱の高さsclx0.2818)×円周率×(円柱の高さsclx0.2818) /3 /1000000
'y scl =（(x ? - 9.6931?）/174?）^2 * 1206 scl
'
'円錐部までを固定値として  x? →  yscl を導きます。
'?=半径(550)×半径(550)×円周率×( (円柱の高さscl-1206)sclx0.2818)/1000000 + 174?(円錐部までの容量）
'x?+174?=(0.26766773 * y+1206 scl) 
'y scl =(x ? - 174 ?)/0.26766773 + 1206 scl

'===================================================================================================================
'【 初期化処理 】
if CR2008 then
    浸漬タンクAAutoMode=ON
    浸漬タンクAAutoRun=OFF
    浸漬タンクA許可=ON
    浸漬タンクAOrgErr=OFF
    浸漬タンクAErr=OFF
    浸漬タンクAEmg=OFF
    浸漬タンクAstep=0
    浸漬タンクAErrStep=0
    浸漬タンクAOrgErrStep=0
    浸漬タンクAEmgStep=0

end if
'===================================================================================================================
'【 原点 】
浸漬タンクAOrg=1

'===================================================================================================================
'【 緊急停止 】
if not(PB非常停止) then
	浸漬タンクAEmg=ON
	浸漬タンクAEmgStep=1
end if

select case 浸漬タンクAEmgStep

case 0

case 1
	ejectSV6_給水電磁弁A=OFF
	inc(浸漬タンクAEmgStep)
	
case 2
	if ResetFlg then
		inc(浸漬タンクAEmgStep)
	end if
	
case 3
	if StartFlg then
		res(TIM_冷却ON_A)
		res(TIM_冷却OFF_A)	
		浸漬タンクAEmgStep=0
	end if

end select 




'===================================================================================================================
'【 タイムエラー検出および計測エラー検出】

'===================================================================================================================
' センサー検出ディレイ―

	'tmr(PDL1_パドルセンサー上限A,tim_PDL1_パドルセンサー上限A,20)
	tmr(PDL2_パドルセンサー下限A,tim_PDL2_パドルセンサー下限A,20)



'===================================================================================================================
'【 System条件 】
'次のフラグはリードコマンド（書き換え不可）
'System :: 浸漬タンクAAutoMode	自動モード セレクトスイッチ
'System :: 浸漬タンクAAutoRun	継続運転可能
'System :: 浸漬Aユニット許可 該当ユニット動作可能 
'System :: EmgFlg	その場停止

if SSW3_自動モード and not(アルファ化米モード) then

	RLY5_パドルセンサ電源=ON

	if 前処理注水完了 and 前処理工程step=0 then
		
		tmr(TIM_冷却ON_A, #1200) 'ON=10秒
		tmr(TIM_冷却OFF_A, #9000) 'OFF=30分
		if ldp(TIM_冷却OFF_A.B) then
			res(TIM_冷却OFF_A) '自分のタイマーをクリアし、30分ごとのトリガを発生
			res(TIM_冷却ON_A)
		end if

		if not(SV60_排水バルブ開A) and not(pnlPB強制米無しA) and (pnlPB強制米有A or PDL2_パドルセンサー下限A or FLOS3_LMT121 or (DM_Aタンク設定値>0 and インターバル給水中)) then
			if not(TIM_冷却ON_A.B) then
				extSV6_給水電磁弁A=ON
			else
				extSV6_給水電磁弁A=OFF	
			end if

		else
			extSV6_給水電磁弁A=OFF	
		end if

	else
		extSV6_給水電磁弁A=OFF
		res(TIM_冷却OFF_A)'自分のタイマーをクリアし、30分ごとのトリガを発生
		res(TIM_冷却ON_A)
	end if

else
	extSV6_給水電磁弁A=OFF
	RLY5_パドルセンサ電源=OFF
end if